# RIDAGEYR = age
# RIAGENDR = sex
# RIDRETH1 = race
# DMDEDUC2 = education
# DMDMARTL = status_love
# INDFMPIR = cost
# BMXBMI = BMI
# BMXWAIST = Chu vi vong eo
# LBXTC = Total Cholesterol
# LBXTR = Triglycerid (mg/dl)
# LBDHDD = HDL-C (mg/dl)
# LBXSGL = Glucose huyet tuong (mg/dl)
# LBXSATSI = ALT (U/L)
# LBXASSI = AST (U/L)

###########################
###### Results S7 #########
###########################
# ================ KẾT QUẢ CHO: ALL-CAUSE MORTALITY (ACM) TẠI 10 NĂM ================
#   Mô hình gốc (TyHGB) - C-index: 0.838 (0.811-0.865)
# 
# Model so sánh | C-index New (95%CI) | P DeLong | Cont. NRI (95%CI)   | P (NRI)  | IDI (95%CI)         | P (IDI) 
# ------------------------------------------------------------------------------------------------------------ 
#   Est. Lower Upper p-value
# M1 0.009 0.004 0.017       0
# M2 0.125 0.035 0.244       0
# M3 0.003 0.001 0.009       0
# TyHGB+ABSI   | 0.841 (0.814-0.867) | 0.9020   | 0.003 (0.001-0.009) | <0.001   | 0.009 (0.004-0.017) | <0.001  
# Est. Lower Upper p-value
# M1 0.011 0.004 0.019    0.00
# M2 0.144 0.043 0.252    0.00
# M3 0.005 0.001 0.010    0.02
# TyHGB+WWI    | 0.841 (0.814-0.868) | 0.8850   | 0.005 (0.001-0.010) | 0.0200   | 0.011 (0.004-0.019) | <0.001  
# Est.  Lower Upper p-value
# M1 0.007  0.003 0.014   0.000
# M2 0.153  0.062 0.227   0.000
# M3 0.001 -0.002 0.004   0.257
# TyHGB+WHtR   | 0.840 (0.813-0.867) | 0.9385   | 0.001 (-0.002-0.004) | 0.2570   | 0.007 (0.003-0.014) | <0.001  


# ================ KẾT QUẢ CHO: CARDIOVASCULAR MORTALITY (CVM) TẠI 10 NĂM ================
#   Mô hình gốc (TyHGB) - C-index: 0.874 (0.840-0.908)
# 
# Model so sánh | C-index New (95%CI) | P DeLong | Cont. NRI (95%CI)   | P (NRI)  | IDI (95%CI)         | P (IDI) 
# ------------------------------------------------------------------------------------------------------------ 
#   Est.  Lower Upper p-value
# M1 0.004 -0.001 0.013   0.277
# M2 0.073 -0.085 0.243   0.356
# M3 0.001 -0.002 0.002   0.297
# TyHGB+ABSI   | 0.877 (0.846-0.909) | 0.8749   | 0.001 (-0.002-0.002) | 0.2970   | 0.004 (-0.001-0.013) | 0.2770  
# Est.  Lower Upper p-value
# M1 0.005 -0.003 0.017   0.158
# M2 0.109 -0.065 0.279   0.238
# M3 0.001 -0.001 0.006   0.119
# TyHGB+WWI    | 0.879 (0.848-0.910) | 0.8297   | 0.001 (-0.001-0.006) | 0.1190   | 0.005 (-0.003-0.017) | 0.1580  
# Est.  Lower Upper p-value
# M1 0.002 -0.004 0.009   0.396
# M2 0.133 -0.043 0.252   0.139
# M3 0.001 -0.002 0.002   0.594
# TyHGB+WHtR   | 0.876 (0.843-0.908) | 0.9332   | 0.001 (-0.002-0.002) | 0.5940   | 0.002 (-0.004-0.009) | 0.3960  


